for i in range(2):
    for j in range(4):
        for k in range(3):
            print(k, end=" ")
        print()
    print()

'''
اجرا از درونی ترین حلقه شروع میشه
i : 0 , j : 0 , k : 0
i : 0 , j : 0 , k : 1
i : 0 , j : 0 , k : 2
در این جا حلقه درونی سه بار اجرا شده و خرجی به شکل (0 1 2) که سطرهای ماتریس هستند
این روند در یک حلقه دیگه هست که شمارنده آن 4 هست پس این روند سه بار دیگه هم تکرار میشه.

i : 0 , j : 1 , k : 0
i : 0 , j : 1 , k : 1
i : 0 , j : 1 , k : 2

i : 0 , j : 2 , k : 0
i : 0 , j : 2 , k : 1
i : 0 , j : 2 , k : 2

i : 0 , j : 3 , k : 0
i : 0 , j : 3 , k : 1
i : 0 , j : 3 , k : 2

یعنی تا این جا حلقه درونی 12 بار اجرا شده و حلقه بیرونی تر 4 بار و یک ماتریس شکل گرفته بصورت:

0 1 2 
0 1 2 
0 1 2 
0 1 2 
همین روند یک بار دیگه هم تکرار میشه به دلیل بیرونی ترین حلقه که شمارنده آن 2 هست
یعنی در نهایت درونی ترین حلقه 24 بار، حلقه میانی 8 بار و بیرونی ترین حلقه دو بار اجرا میشود

'''